In [5]:
import numpy as np
import pandas as pd

In [6]:
np.random.seed(667)
mydata = np.random.randint(0,101,(4,3))
mydata

array([[ 85,  15,  89],
       [100,   3,  90],
       [  2,  64,   0],
       [ 36,  99,  47]])

In [12]:
myindex = ['ca','ny', 'az','tx']
mycolumns = ['jan', 'feb','mar']

In [15]:
df= pd.DataFrame(data=mydata, index=myindex, columns=mycolumns)
df

    jan  feb  mar
ca   85   15   89
ny  100    3   90
az    2   64    0
tx   36   99   47

In [17]:
df = pd.DataFrame(mydata,myindex,mycolumns)
df

    jan  feb  mar
ca   85   15   89
ny  100    3   90
az    2   64    0
tx   36   99   47

In [19]:
df.info()
#string in pandas = object

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, ca to tx
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   jan     4 non-null      int32
 1   feb     4 non-null      int32
 2   mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes